tap "homebrew/cask-fonts"
tap "buo/cask-upgrade" # provides 'brew cu' cask upgrade command

brew "MonitorControl"
brew "ansible-language-server"
brew "ansible-lint"
brew "aria2"
brew "atool"
brew "automake"
brew "basedpyright"
brew "bash" # for improved performance
brew "bat"
brew "bitwarden-cli"
brew "blueutil" # for Hammerspoon
brew "borgbackup"
brew "coreutils"
brew "curl"
brew "defaultbrowser"
brew "direnv"
brew "docx2txt" # for scope.sh
brew "duti"
brew "eget"
brew "entr"
brew "exiftool" # for scope.sh
brew "eza"
brew "fasd"
brew "fd"
brew "fdupes"
brew "figlet"
brew "findutils"
brew "fzf"
brew "git"
brew "git-delta"
brew "gitlint"
brew "grep" # for file-list
brew "gzip"
brew "hexedit"
brew "httpie"
brew "hyperfine"
brew "iftop"
brew "isync"
brew "jq"
brew "latexindent" # for NeoVim
brew "lemminx"
brew "lf"
brew "libqalculate" # includes CLI
brew "lua-language-server"
brew "lua@5.3" # for lua-lsp
brew "luarocks"
brew "lzip"
brew "make" # GNU make with Mac OS is ancient
brew "markdownlint-cli"
brew "mas"
brew "moreutils" # isutf8 for Hammerspoon
brew "ncdu"
brew "neovim"
brew "ollama"
brew "pandoc" # for scope.sh
brew "pipx"
brew "podman-desktop"
brew "poppler" # pdftotext for scope.sh
brew "pre-commit"
brew "pstree"
brew "pwgen"
brew "python3"
brew "ripgrep"
brew "ripgrep-all"
brew "rsync"
brew "ruff" # for neovim LSP
brew "shellcheck" # to support bash-language-server
brew "shellharden"
brew "shfmt"
brew "smudge/smudge/nightlight"
brew "sqlfluff"
brew "stow"
brew "stylua"
brew "terminal-notifier"
brew "terraform-ls"
brew "texlab"
brew "tflint"
brew "tig"
brew "tmux"
brew "trash"
brew "w3m"
brew "watch"
brew "wget"
brew "yamllint"
brew "yq"
brew "zsh-lovers"

cask "drawio"
cask "font-consolas-for-powerline" # for kitty
cask "hammerspoon"
cask "karabiner-elements"
cask "keepassxc"
cask "kitty"
cask "librewolf", args: { quarantine: false }
cask "notunes"
cask "platypus"
cask "poe"
cask "visual-studio-code"
cask "whatsapp"

# vim: set filetype=ruby:
